# DBMS Lab Assignment

In [11]:
! pip install -r requirements.txt

In [1]:
import sqlalchemy
sqlalchemy.create_engine('sqlite:///dbms_lab_assginment.db')

Engine(sqlite:///dbms_lab_assginment.db)

In [2]:
%load_ext sql
%sql sqlite:///dbms_lab_assginment.db

In [3]:
%%sql 
CREATE TABLE Employee (
    Emp_id  varchar2(5) PRIMARY KEY,                         
    F_Name varchar2(15) NOT NULL,
    L_Name varchar2(15) NOT NULL, 
    city varchar(10),
    Gender char(1) ,                                                 
    Emp_hire_date  date,
    Job_code varchar(5),
    Supervisor_id  varchar(5),
    Dept_no number(4),
    CONSTRAINT CHK_gender CHECK (Gender IN ('M', 'm', 'F', 'f')),
    CONSTRAINT FK_SupervisorID FOREIGN KEY (Supervisor_id)
    REFERENCES Employee(Emp_id),
    CONSTRAINT FK_DeptNo FOREIGN KEY (Dept_no)
    REFERENCES Department(Dept_no)
);

* sqlite:///dbms_lab_assginment.db
Done.

[]

In [4]:
%%sql 
CREATE TABLE Department (
     DepNo number(4) PRIMARY KEY,
     DName varchar(15),
     Mgr_id char(9) NOT NULL,
     CONSTRAINT U_deptName UNIQUE (DName),
     CONSTRAINT FK_MgrID FOREIGN KEY (Mgr_id)
     REFERENCES Employee(Emp_id)

);

* sqlite:///dbms_lab_assginment.db
Done.

[]

In [5]:
%%sql 
CREATE TABLE Project(
    PNumber number(5) PRIMARY KEY,
    PName varchar(15) NOT NULL,
    DepNo number(4),
    CONSTRAINT FK_DepNum FOREIGN KEY (DepNo)
    REFERENCES Department(DepNo) 
);

* sqlite:///dbms_lab_assginment.db
Done.

[]

In [6]:
%%sql 
CREATE TABLE Works_on (
    PNo number(5),
    emp_id varchar(5),
    CONSTRAINT FK_empID FOREIGN KEY (emp_id)
    REFERENCES Employee(Emp_id),
    CONSTRAINT FK_prjtnum FOREIGN KEY (PNo)
    REFERENCES Project(PNumber)
);

* sqlite:///dbms_lab_assginment.db
Done.

[]

In [7]:
%%sql 
CREATE TABLE Dependent (
     Emp_id varchar(5) PRIMARY KEY,
     Dependent_Name varchar(15) NOT NULL,                      
     Gender char(1), 
     CONSTRAINT CHK_gender CHECK (Gender IN ('M', 'm', 'F', 'f')),
     CONSTRAINT FK_empID FOREIGN KEY (emp_id)
     REFERENCES Employee(Emp_id)
);

* sqlite:///dbms_lab_assginment.db
Done.

[]

In [8]:
%%sql 
INSERT INTO Employee
('Emp_id','F_Name','L_Name','city','Gender','Emp_hire_date','Job_code','Supervisor_id','Dept_no')
VALUES
(501,'Saahil','Ali','Indore','M','2018-08-08','INTRN','NA',29),
(502,'William','SmithField','NYC','M','2004-06-22','500','WSMGR',44),
(503,'Rebeca','Black','Manhattan','F','2017-12-09','500','RBMGR',65),
(5,'Jada','Facer','Houston','F','2000-05-15','682','JFMKT',508),
(504,'John','Corner','Houston','M','2001-02-15','682','JCMKT',508),
(505,'Maria','Smith','Houston','F','2005-07-10','897','MSACT',508);

* sqlite:///dbms_lab_assginment.db
6 rows affected.

[]

In [9]:
%%sql
SELECT * FROM Employee

* sqlite:///dbms_lab_assginment.db
Done.

[('501', 'Saahil', 'Ali', 'Indore', 'M', '2018-08-08', 'INTRN', 'NA', 29),
 ('502', 'William', 'SmithField', 'NYC', 'M', '2004-06-22', '500', 'WSMGR', 44),
 ('503', 'Rebeca', 'Black', 'Manhattan', 'F', '2017-12-09', '500', 'RBMGR', 65),
 ('5', 'Jada', 'Facer', 'Houston', 'F', '2000-05-15', '682', 'JFMKT', 508),
 ('504', 'John', 'Corner', 'Houston', 'M', '2001-02-15', '682', 'JCMKT', 508),
 ('505', 'Maria', 'Smith', 'Houston', 'F', '2005-07-10', '897', 'MSACT', 508)]

In [10]:
%%sql 
INSERT INTO Department
('DepNo','DName','Mgr_id')
VALUES 
(29,'InternsDept','501'),
(44,'Management','502'),
(65,'Logistics','503'),
(508,'Marketting','5');

* sqlite:///dbms_lab_assginment.db
4 rows affected.

[]

In [11]:
%%sql 
SELECT * FROM Department

* sqlite:///dbms_lab_assginment.db
Done.

[(29, 'InternsDept', '501'),
 (44, 'Management', '502'),
 (65, 'Logistics', '503'),
 (508, 'Marketting', '5')]

In [12]:
%%sql 
INSERT INTO Project
('PNumber','PName','DepNo')
VALUES
(3388,'ProjectF',29),
(1495,'Manage',44),
(5465,'Shipit',65),
(4578,'Sellit',508);

* sqlite:///dbms_lab_assginment.db
4 rows affected.

[]

In [13]:
%%sql 
SELECT * FROM Project

* sqlite:///dbms_lab_assginment.db
Done.

[(3388, 'ProjectF', 29),
 (1495, 'Manage', 44),
 (5465, 'Shipit', 65),
 (4578, 'Sellit', 508)]

In [14]:
%%sql 
INSERT INTO  Works_on 
('PNo', 'emp_id')
VALUES
(4578,'5'),
(3388,'501'),
(1495,'502'),
(5465,'503'),
(4578,'504'),
(4578,'505');

* sqlite:///dbms_lab_assginment.db
6 rows affected.

[]

In [15]:
%%sql 
SELECT * FROM Works_on

* sqlite:///dbms_lab_assginment.db
Done.

[(4578, '5'),
 (3388, '501'),
 (1495, '502'),
 (5465, '503'),
 (4578, '504'),
 (4578, '505')]

In [16]:
%%sql 
INSERT INTO Dependent 
('Emp_id','Dependent_Name','Gender')
VALUES
('5','Aaron Facer','M'),
('501','Naazneen Ali','F'),
('502','Robin SmithField','M'),
('503','Kurtz Black','M'),
('504','Sarah Corner','F'),
('505','Will Smith','M');

* sqlite:///dbms_lab_assginment.db
6 rows affected.

[]

In [17]:
%%sql 
SELECT * FROM Dependent

* sqlite:///dbms_lab_assginment.db
Done.

[('5', 'Aaron Facer', 'M'),
 ('501', 'Naazneen Ali', 'F'),
 ('502', 'Robin SmithField', 'M'),
 ('503', 'Kurtz Black', 'M'),
 ('504', 'Sarah Corner', 'F'),
 ('505', 'Will Smith', 'M')]